{"https://www.yutorah.org/lectures/1150968/It's-Dark-Outside,-But-It's-Light-in-Here:-Engendering-an-Environment-of-Positive-Energy": "## Shiur Notes: The Power of Positivity in the *Beis Medrash*\n\n**Theme:** The power of focusing on and speaking about what is right versus what is wrong, and how this affects the environment and personal growth.\n\n---\n\n### I. The Spreading Nature of Negativity (*Tumah*)\n\n**Source: פרשת נח (Parshas Noach)**\n\n*   The state of the world before the *mabul*: וַיִּשְׁחִת כָּל בָּשָׂר אֶת דַּרְכּוֹ עַל הָאָרֶץ.\n*   **Rashi's Remark:** The corruption was so deep that it affected the animal kingdom: \"אפילו בהמה חיה ועוף נזקקין שלא למיניהן\" (Even animals, beasts, and birds engaged in immoral behavior).\n*   **The Beis Halevi’s Question:** Why mention the animals? They lack *bechira* (free will). What relevance is their immorality?\n*   **The Beis Halevi’s Insight:** When a person acts with a negative *middah* (e.g., *ta'avah*), it introduces a specific *koach* (spiritual force) of *tumah* (impurity) into the world.\n    *   This *koach* spreads and becomes palpable in the atmosphere, affecting everything around it, even the actions of animals.\n*   **Application:** This principle holds true for all negative *middos*. When we focus on the negative, we introduce a negative *koach* into our environment.\n\n---\n\n### II. The Power of Positive Speech (*Lashon Mu'gena*)\n\n**Source: גמרא מנחות דף גמל (Gemara Menachot 3a)**\n\n*   **Teaching:** One should never utter a disgusting thing from his mouth (דבר מגונה מפיו).\n*   **Proof:** The Torah uses eight letters to describe a non-kosher animal: \"אֲשֶׁר אֵינָהּ טְהוֹרָה\" (which is not pure), instead of using two letters for \"טְמֵאָה\" (impure).\n*   **Significance:** The *Gemara* states that one who is cautious in their speech is destined for greatness. It was a sign that the individual would become a *מורה הוראה בישראל*.\n*   **Connection to Noach:** This lesson is taught right before *Noach* enters the *teivah*.\n    *   *Hashem* was instructing *Noach* to be careful: Negativity spreads, and the *teivah* must be protected from the negative energy of the outside world.\n\n---\n\n### III. Communal Impact and *Viduy*\n\n*   **Observation:** We recite the *viduy* (confession) using the plural form (אשמנו, בגדנו — *we* have sinned).\n*   **Reason:** When one person sins, or when one person spreads negativity, it affects the entire community. When I continuously focus on what is wrong, I block the ability of others to see what is good, creating a shared negative environment.\n\n---\n\n### IV. The Choice of *Noach* and the *Tzohar*\n\n*   **Noach’s Silence:** We barely hear Noach speak throughout the narrative of the *Mabul*.\n    *   **Insight:** If anyone had a reason to complain about his lot, it was Noach (being surrounded by *resha'im*, building the *teivah* for 120 years, becoming a zookeeper). Yet, he didn't complain; he simply *did* what *Hashem* commanded him.\n    *   He didn't waste time focusing on the wrong things to talk about.\n*   **The *Tzohar* (Light):** The *pasuk* commands: צֹהַר תַּעֲשֶׂה לַתֵּבָה (You shall make a *Tzohar* for the *teivah*).\n    *   **The Derash (Rav Dush, suggested):** *Noach* had a choice:\n        1.  Look out the *window* and focus on the negativity, destruction, and what he was missing outside.\n        2.  Figure out how to create *light* (*Tzohar*, interpreted as a precious stone/light source) *inside* the *teivah* he was in.\n\n*   **Conclusion from the Beis Halevi:** If the *koach* of negative *middot* spreads, the *koach* of positive *middot* and positive speech spreads as well. Focus on what is **right**.\n\n---\n\n### V. Practical Application and Building Energy\n\n**Analogy: Birds Flying South**\n\n*   Birds fly in a V-formation, flapping their wings together. This synchronization creates energy that allows them to use 25-30% less energy than flying alone.\n*   **The Lesson:** This cooperative effort is the positive energy that must be created in our *Beis Medrash*.\n\n**The Call to Action**\n\n1.  **Be a Problem Solver:** It is right to identify issues and strive to fix them, but do so with positive intent. Look for solutions, assume best intentions, and offer constructive suggestions.\n2.  **Avoid Negativity Spirals:** Be careful not to let the desire to fix things turn into a negativity that stifles your own growth or brings others down.\n3.  **Talk It Up:** Spread positive energy by actively discussing the good things here:\n    *   \"I love *Elul*!\"\n    *   \"This *shiur* is amazing.\"\n    *   \"My *chavrusa* is incredible.\"\n4.  **Emulate Noach:** Leave the negativity and *tumah* of the outside world outside the *teivah* (the *Beis Medrash*).\n    *   Focus on the *tova* (*Hashem*’s gift) of being here: \"וַאֲנִי בְּרֹב חַסְדְּךָ אָבוֹא בֵיתֶךָ\" (I will come to your house through your great kindness).\n    *   Let's create our own light and build the *teivah* together."}